# -*- mode:org; -*-

#+title:Server-Side Development with NodeJS, Express, and MongoDB
#+author:The Hong Kong University of Science and Technology
#+date:2019-12-14 08:05
#+subtitle: {{{version}}} {{{date}}}
#+macro:version Version 0.0.21

#+texinfo: @insertcopying

**** A Simple HTTP Server

From within the Org buffer, create this project by issuing the following commands
commands:

1. =C-c C-v b= to execute the bash scripts to initialize the Node project
2. =C-c C-v t= to tangle the ~index.js~ file into the project directory
3. =cd node-http= to move into the project directory
4. =yarn start=  to start the ~http~ server
5. =open localhost:3000= to open a browser and hit the server

- Create a folder named ~node-http~ in the NodeJS folder and move into the
  folder.

- In the ~node-http~ folder, create a subfolder named ~public~.

- At the prompt, type the following to initialize a ~package.json~ file in the
  ~node-examples~ folder.

  #+name:http-server-create-public-subfolder
  #+begin_src sh :results silent :eval never-export
    mkdir -p node-http/public && cd node-http && npm init -y
  #+end_src

- Accept the standard defaults suggested, and add a =scripts.start = node index"
  until you end up with a ~package.json~ file containing the following:

  #+begin_src js :eval never
    {
      "name": "node-http",
      "version": "1.0.0",
      "description": "Node HTTP Module Example",
      "main": "index.js",
      "scripts": {
        "test": "echo \"Error: no test specified\" && exit 1",
        "start": "node index"
      },
      "author": "Jogesh Muppala",
      "license": "ISC"
    }
  #+end_src

  #+name:http-server-package.json-start-script
  #+begin_src js :results output :eval never-export
    const fs = require('fs');
    let package = JSON.parse(fs.readFileSync("./node-http/package.json", "utf-8"));
    package.scripts.start = "node index";
    fs.writeFileSync('./node-http/package.json', JSON.stringify(package, null, 2));
    console.log(JSON.stringify(package, null, 2));
  #+end_src

  #+RESULTS: http-server-package.json-start-script
  #+begin_example
  {
    "name": "node-http",
    "version": "1.0.0",
    "description": "",
    "main": "index.js",
    "scripts": {
      "test": "echo \"Error: no test specified\" && exit 1",
      "start": "node index"
    },
    "keywords": [],
    "author": "",
    "license": "ISC"
  }
  #+end_example

- Create a file named ~index.js~ and add the following code to it:

  #+name:http-server-index.js
  #+begin_src js :eval never :tangle node-http/index.js :results silent
    const http = require('http');

    const hostname = 'localhost';
    const port = 3000;

    const server = http.createServer((req, res) => {
        console.log(req.headers);
        res.statusCode = 200;
        res.setHeader('Content-Type', 'text/html');
        res.end('<html><body><h1>Hello, World!</h1></body></html>');
    })

    server.listen(port, hostname, () => {
      console.log(`Server running at http://${hostname}:${port}/`);
    });
  #+end_src

- Start the server by typing the following at the prompt:

  : npm start

- Then you can type:

  :  http://localhost:3000

  {{{noindent}}}in your browser address bar and see the result.

- You can also use [[http://www.getpostman.com/][postman]] chrome extension to send requests to the server and
  see the response.  Alternately, you can download the stand-alone Postman tool
  from http://getpostman.com and install it on your computer.

- Initialize a Git repository, check in the files and do a Git commit with the
  message "Node HTTP Example 1".

